# git init -> превращает текущую директорию в git репозиторий (создается .git)
# git add .(.-> все файлы,можно указать отдельные файлы) -> отслеживание всех файлов
# git commit -m "commit" -> добавляет или соверщает сохранение в git всех файлов которые находятся в индексе
# git log -> выводит журнал или log сохранений
# git status -> файлов
# git remote add origin(названиесвязи-обычно rigin)SSH(ссылка на удаленный репозиторий)
# git checkout hash_commit -> просматриваем версию
# git branch -> выводит терминал список всех веток (звёздочкой помечена активная ветка)
# git checkout<название>
#                               - переход на указанную ыетку
# git switch <название ветки>
# git push origin(название_ветки) master/main(название_ветки) -> отправка версии на удаленный репозиторий

# git clone <ссылк_на_удаленный_репозиторий> -> слконировать/скопировать/скачать репозиторийч


# hello

# test1